[
    {
        "companyName": "Charles Schwab",
        "jobTitle": "Associate Software Engineer",
        "timePeriod": "Jun. 2023 - Present",
        "description": "I returned to Charles Schwab after my internship. Since then, I led the effort to update servers for five different applications. I setup over 50 servers for an updated operating system. I also created new API endpoints for two different applications in the company's Retirement Business Services. As part of their new employeee program, I earned certifications for Google Cloud Certified Associate Cloud Engineer and Professional Scrum Master. Currently, I work remote in the Orlando area.",
        "logo": "/schwab_logo.webp",
        "devTools": ["Java", "Spring", "Google Cloud", "Scrum"]
    },
    {
        "companyName": "Charles Schwab",
        "jobTitle": "Software Engineer Intern",
        "timePeriod": "Jun. 2022 - Aug. 2022",
        "description": "I accepted an internship with Charles Schwab in October 2021. I had good experience with the company as a client and was excited to join the team. As an intern, I worked with Java and Spring to create two new endpoints for fetching the prices of assets. I automated testing of a webpage using Cucumber for Java and Gherkin, cutting time from QA review. Throughout my time, I explored the Scrum process, SQL, Continuous Integration/Development, and Splunk. I worked in their corporate Phoenix office.",
        "logo": "/schwab_logo.webp",
        "devTools": ["Java", "Spring", "Cucumber", "Gherkin"]
    },
    {
        "companyName": "UCF",
        "jobTitle": "Teaching Assistant",
        "timePeriod": "Jan. 2022 - May 2023",
        "description": "Professor Sean Szumlanski asked me to join his TA Team after completing the core data structures and algorithms courses. I advised roughly 20 students during office hours per month. I answered questions on the programming assignnments, lectures, and the notes. I guided students in both C and Java languages. Overall, I evaluated 200 students in four sections of the courses. This included grading 200 programming assignments and 100 exams per semester.",
        "logo": "/ucf_logo.webp",
        "devTools": ["C", "Java", "Data Structures", "OOP"]
    },
    {
        "companyName": "Knight Hacks",
        "jobTitle": "Treasurer",
        "timePeriod": "Jan. 2022 - May. 2022",
        "description": "During the spring semester, I was elected Treasurer of the university's largest Computer Science-focused student organization. My peers picked me for securing donations from companies such as Microsoft, Google Cloud, EA Sports, and ManTech for our hackathon. As Treasurer, I managed the organization's $10,000 budget and finances. With the executive board, I coordinated club logistics by scheduling over 20 events, hiring directors, answering member questions, and ordering merchandise.",
        "logo": "/knighthacks_logo.webp",
        "devTools": ["Leadership", "Teamwork"]
    },
    {
        "companyName": "UCF",
        "jobTitle": "Resident Assistant",
        "timePeriod": "Aug. 2020 - May 2023",
        "description": "As an RA, I guided freshman residents living on campus by establishing connections, leading them to resources, and assisting them by answering their questions. Each semester, I managed a floor of over 50 residents. I decorated the floor and updated the walls with posters of clubs and upcoming events. I trained in crisis response in order to provide a safe space for students.",
        "logo": "/ucf_logo.webp",
        "devTools": ["Leadership", "Time Management", "Communication"]
    }
]