[
    {
        "projectName" : "Portfolio Website",
        "position" : "Developer",
        "timePeriod" : "Apr. 2022 - Present",
        "description" : "I wanted to work on a resume website for a while, however other projects and school work often got in the way. Finally, after graduation I was able to finally to start working on this website. Design tools are not my strongest suite, so I guided a friend on how I wanted the website to look and he was able to create a mock of it using Figma. Using this design, I developed a website with 5 sections. I made the Modal component as generic as possible to allow code reuse for the Projects Modal and Experience Modal. This minimized the amount of copied code and made editing and debugging come down to 1 component. Using JSON, I have eliminated most hardcoded values in the code.",
        "linkedSites" : ["https://github.com/nategaulke/personal-website"],
        "color" : "blue"
    },
    {
        "projectName" : "MovieMentor",
        "position" : "Lead Frontend Developer",
        "timePeriod" : "Aug. 2022 - May 2023",
        "description" : "I completed two Senior Design courses at the University of Central Florida to complete my bachelor's degree. I presented an original idea to 5 of my peers that would become Movie Mentor. We created a website database where users could look up a movie and find content warnings such as gore or something traumatic. I researched web frontend tools. I then wrote 30 pages explaining the options and arguing which tools we should use. I led development on the React and Tailwind CSS website. I managed two other team members building the website. I created four different web pages and oversaw the making of the other pages. We then presented our project to three professors and were awarded an A grade for our project.",
        "linkedSites" : ["https://github.com/ContentWarnings/WebFrontend", "https://moviementor.app/"],
        "logo" : "/moviementor.webp",
        "color" : "violet"
    },
    {
        "projectName" : "Multi-Multiplication",
        "position" : "Backend Developer",
        "timePeriod" : "Mar. 2023 - Apr. 2023",
        "description" : "I was in a Parallel & Distributed Systems class my last semester. The last assignment was a team project with four other classmates. We created a multithreaded program in Java that could multiply multiple matrices together. I organized the code that multiplied the rows and columns together most efficiently. Another group worked on finding the optimal order to multiply the matrices. The optimized multiplication allowed us to multiply two 2000 x 2000 matrices using 10 threads in 10 seconds when the brute force solution took 15 seconds. For 1000 matrices of varying sizes, our optimized 10 thread solution finished in half a second compared to the 5 seconds of the brute force solution. Linked in the Github is our report with the research and results.",
        "linkedSites" : ["https://github.com/ElijahMSmith/COP4520_Project"],
        "logo" : "",
        "color" : "green"
    },
    {
        "projectName" : "Meet4Meal",
        "position" : "Mobile Developer",
        "timePeriod" : "Sep. 2022",
        "description" : "After attending virtual hackathons, I was finally able to go to my first in-person hackathon, ShellHacks, at the University of Miami. Over the 36 hours of the competition, I constructed a React Native mobile app with a team of 3 other engineers. The app allowed users to either offer food to someone or ask to share a meal with someone. Users were then matched together. I designed the overall layout for 3 screens of the application: the Profile page, Add New Request Page and the Matches Page. I then connnected these pages with 3 different API endpoints. While my team did not win the competition, I was grateful for the experience and the challenge of coding a project in a short amount of time.",
        "linkedSites" : ["https://github.com/nategaulke/MealShareApp-FE", "https://devpost.com/software/meet4meal"],
        "logo" : "/m4m.webp",
        "color" : "red"
    },
    {
        "projectName" : "Knight Assistant",
        "position" : "Backend Development Lead",
        "timePeriod" : "Feb. 2021 - Apr. 2021",
        "description" : "I signed for the projects program in the student organization Knight Hacks. During the semester, I collaborated virtually with 2 teammates to create a Discord bot in Python that acted as a personal assistant for a club's Discord server. Each week, I oversaw team meetings, checked the progress of my teammates, and assigned new features to be added. We spent over the 11 weeks on the project. I implemented a calendar feature with 3 seperate commands. I connnected the bot to a MongoDB Database to store this information. I also added a school break command that found the next day off using a JSON request. At the end of the semester, we presented our project to a panel of judges. We won first place among a pool of 10 teams that were in the program.",
        "linkedSites" : ["https://github.com/nategaulke/Knight-Assistant"],
        "logo" : "",
        "color" : "yellow"
    }
]
